---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.ConnectorSeparator
source: html/ca95fd1d-8c62-437a-f0be-feefe37ec20f.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.ConnectorSeparator Property

The duct connector separator string.

## Syntax (C#)
```csharp
public string ConnectorSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null